Repository: Kotti/kotti_contactform
Catalog: kotti_contactform/locale/*/LC_MESSAGES/kotti_contactform.po
Languages: ro

source: Default sender address
ro: Adresa implicită de expediere

source: Specify the default sender address for your contact forms.
ro: Specifică adresa implicită a expeditorului pentru formularele tale.

source: Show captcha
ro: Arată captcha

source: Use a reCaptcha in your contact forms.
ro: Folosește un reCaptcha in formularele tale.

source: Public key
ro: Cheie publică

source: Your public key.
ro: Cheia ta publică.

source: Private key
ro: Cheie privată

source: Your private key.
ro: Cheia ta privată.

source: Red
ro: Roșu

source: White
ro: Alb

source: Clean
ro: Curăță

source: reCaptcha theme
ro: Temă reCaptcha

source: Contact form settings
ro: Setări pentru formularul de contact

source: Settings for kotti_contactform
ro: Setări pentru kotti_contactform

source: Successfully saved kotti_contactform settings.
ro: Setările kotti_contactform au fost salvate cu succes.

source: Contact form
ro: Formular de contact

source: Show attachment
ro: Arată fișier atașat

source: If activated, the user can upload an attachment.
ro: Dacă e activat, utilizatorul poate atașa fișier.

source: Contact Form
ro: Formular de contact

source: Maximum file size: ${size}MB
ro: Dimensiune maximă a fișierului: ${size}MB

source: Full Name
ro: Nume și prenume

source: E-Mail Address
ro: Adresă de e-mail

source: Subject
ro: Subiect

source: Your message
ro: Mesajul tău

source: Attachment
ro: Fișier atașat

source: Submit
ro: Trimite

source: Thanks for your submission!
ro: Mulțumim pentru mesaj!

source: Could not connect to the captcha service.
ro: Conexiune imposibilă la serviciul captcha.

source: There was an error talking to the recaptcha server ({0})
ro: A apărut o problemă la recaptcha server ({0}).

source: Incorrect solution
ro: Soluție incorectă
